Repository: WPPlugins/a-staff
Catalog: languages/a-staff-*.po
Languages: hu_hu

# Post Type General Name
source: Staff Members
hu_hu: Csapattagok

# Post Type Singular Name
source: Staff Member
hu_hu: Csapattag

source: Staff Members
hu_hu: Csapattagok

source: Staff Member
hu_hu: Csapattag

source: Member Archives
hu_hu: Tag archívum

source: Parent Member:
hu_hu: Szülő tag:

source: All Members
hu_hu: Minden tag

source: Add New Member
hu_hu: Új tag hozzáadása

source: Add New
hu_hu: Új hozzáadása

source: New Member
hu_hu: Új tag

source: Edit Member
hu_hu: Adatlap szerkesztése

source: Update Member
hu_hu: Adatlap mentése

source: View Member
hu_hu: Tag megtekintése

source: Search Member
hu_hu: Tag keresése

source: Not found
hu_hu: Nem található

source: Not found in Trash
hu_hu: Nem található a Lomtárban

source: Photo of the Member
hu_hu: Tag fényképe

source: Set Member's photo
hu_hu: Tag fényképének beállítása

source: Remove Member's photo
hu_hu: Fénykép eltávolítása

source: Use as Member's photo
hu_hu: Használd ezt a tag képeként

source: Insert into Member's page
hu_hu: Beillesztés a tag oldalára

source: Uploaded to this Member's page
hu_hu: Feltöltve ennek a tagnak az oldalára

source: Members list
hu_hu: Tagok listája

source: Members list navigation
hu_hu: Navigáció a tagok listájában

source: Filter Members list
hu_hu: Taglista szűrése

source: Staff members of your team
hu_hu: A csapatod tagjai

# Taxonomy General Name
source: Member Titles
hu_hu: Munkakörök

# Taxonomy Singular Name
source: Member Title
hu_hu: Munkakör

source: Member Title
hu_hu: Munkakör

source: All Titles
hu_hu: Minden munkakör

source: Parent Title
hu_hu: Szülő munkakör

source: Parent Title:
hu_hu: Szülő munkakör:

source: New Member Title
hu_hu: Új munkakör

source: Add New Member Title
hu_hu: Új munkakör hozzáadása

source: Edit Title
hu_hu: Munkakör szerkesztése

source: Update Title
hu_hu: Munkakör mentése

source: View Title
hu_hu: Munkakör megtekintése

source: You can add titles like "CEO", "Assistant", "Senior Developer", etc. here. Separate titles with commas
hu_hu: Itt tudsz hozzáadni olyan titulusokat, mint "CEO", "Asszisztens", "Senior Fejlesztő", stb. A címeket vesszővel válaszd el egymástól

source: Add or remove Member Titles
hu_hu: Munkakörök hozzáadása és eltávolítása

source: Choose from the most used
hu_hu: Válassz a leggyakrabban használtakból

source: Popular Titles
hu_hu: Gyakori munkakörök

source: Search Member Titles
hu_hu: Keresés a munkakörök közt

source: Not Found
hu_hu: Nem található

source: No items
hu_hu: Üres

source: Titles list
hu_hu: Munkakörök listája

source: Titles list navigation
hu_hu: Navigáció a munkakörök listájában

source: It looks like the version of Themple Framework (%1$s) you are using in your current theme is older than the framework version required by the a-staff plugin (%2$s). Please update your theme to the latest version or contact your web developer.
hu_hu: Úgy tűnik, hogy a sablonban található Themple Framework verzió (%1$s) régebbi, mint az a-staff bővítmény működéséhez szükséges verzió (%2$s). Frissítsd a sablont a legutóbbi verzióra vagy konzultálj a webfejlesztőddel ezzel kapcsolatban.

source: a-staff Default
hu_hu: a-staff alapeset

source: a-staff Settings
hu_hu: a-staff beállítások

source: Social
hu_hu: Közösségi

source: Social Networks setup
hu_hu: Közösségi oldalak beállítása

source: Set up the available social networks here for the a-staff plugin
hu_hu: Állítsd be itt az a-staff bővítmény által használandó közösségi oldalakat

source: Layout
hu_hu: Megjelenés

source: Layout settings
hu_hu: Megjelenés beállításai

source: Settings for the front end layout of this plugin
hu_hu: A bővítmény megjelenése külső felhasználók számára

source: System
hu_hu: Rendszer

source: System settings
hu_hu: Rendszer-beállítások

source: Settings about how the plugin should work under the hood
hu_hu: Beállítások azzal kapcsolatban, hogyan működjön a bővítmény a motorháztető alatt

source: Social Network manager
hu_hu: Közösségi oldal kezelő

source: You can add/remove social networks here that will be available on Staff Member pages
hu_hu: Itt tudod hozzáadni és eltávolítani azokat a közösségi oldalakat, amelyek megjelennek majd a csapattagok oldalain

source: Add Social Network
hu_hu: Közösségi oldal hozzáadása

source: Name of the Social Network
hu_hu: Közösségi oldal neve

source: This is the public name of the social network, it should be something like "Facebook", "Twitter", or similar.
hu_hu: Ez a publikusan megjelenő neve az oldalnak, pl. "Facebook", "Twitter", vagy hasonló.

source: Enter the name of the network here, e.g. "Facebook"
hu_hu: Írd be ide a közösségi oldal nevét, pl. "Facebook"

source: Icon for the Social Network
hu_hu: Közösségi oldal ikonja

source: Choose an icon for the Network
hu_hu: Válassz egy ikont

source: Icon color
hu_hu: Ikon színe

source: Set the color of this icon here.
hu_hu: Válaszd ki az ikon színét itt.

source: Social link target
hu_hu: Közösségi link hol nyíljon

source: Should it open in a new browser tab or in the same tab?
hu_hu: Új böngészőfülön, vagy azon a fülön, amelyen épp állunk.

source: Same tab
hu_hu: Azonos fül

source: New tab
hu_hu: Új fül

source: Social icon size
hu_hu: Közösségi ikon mérete

source: Size of the icon in %1$sFont Awesome sizes%2$s
hu_hu: Az ikon mérete %1$sFont Awesome méretekben%2$s meghatározva

source: Normal
hu_hu: Normál

source: Larger
hu_hu: Nagyobb

source: Double
hu_hu: Dupla

source: Triple
hu_hu: Tripla

source: Enable icon colors?
hu_hu: Ikonszínek használata

source: If enabled, you can specify the color of each social icon separately. Otherwise they will use the default theme colors.
hu_hu: Amennyiben engedélyezett, megadhatod a színét mindegyik ikonnak külön-külön. Másképp a sablon alapszíneit fogják használni.

source: Yes
hu_hu: Igen

source: No
hu_hu: Nem

source: Enable phone numbers?
hu_hu: Telefonszámok engedélyezése?

source: If enabled, you can add phone numbers to the staff member boxes.
hu_hu: Ha engedélyezve van, akkor hozzá lehet adni telefonszámokat a tagok dobozaihoz.

source: Number of columns
hu_hu: Oszlopok száma

source: The default number of columns to be used when displaying staff members in the front end. You can override this setting with the shortcode's <strong>columns</strong> attribute.<br> In the current version 1 to 6 columns are supported.
hu_hu: Az oszlopok száma, amely alapesetben megjelenik a csapattagok oldalán. Ezt a beállítást felülírhatod lokálisan a shortcode <strong>columns</strong> attribútumával.<br> A jelenlegi verzióban 1 - 6 oszlopot lehet beállítani.

source: Add some formatting to the member bio?
hu_hu: Alapszintű formázás a tagok leírásánál?

source: If eanbled, the new lines will be displayed in the member descriptions.
hu_hu: Ha engedélyezve van, akkor a sortörések megjelennek a tag leírásában.

source: Length of member bio
hu_hu: Tag leírás hossza

source: Maximum length of member bio in words. Currently only available if the bio is formatted.
hu_hu: Maximális hossz, szavakban meghatározva. Jelenleg csak a formázott leírásoknál használható.

source: Image sizes in member boxes
hu_hu: Képméretek a csapattagok dobozaiban

source: Which image size should we use in the staff member boxes when it's displayed in the front end? ('c' at the end means that the image is cropped)
hu_hu: Mely képméretet használjuk a csapattagok oszlopaiban, amikor megjelenítjük őket a weboldalon? (a 'c' a végén azt jelenti, hogy vágott képről van szó)

source: You can read more about WordPress image sizes here.
hu_hu: Itt olvashatsz többet a WordPress képméretekről.

source: Box template
hu_hu: Doboz sablon

source: Template editor for the member boxes. You can use the following shorttags in it:<br> <b>{MEMBER_NAME}</b> - Name of the Staff Member (the title of the article)<br> <b>{MEMBER_EXCERPT}</b> - Short bio of Staff Member (the excerpt of the article)<br> <b>{MEMBER_TITLE}</b> - Title of the Staff Member (Member Title taxonomy), will be separated by commas if there is more<br> <b>{MEMBER_SOCICONS}</b> - A list of the Staff Member's social links<br> <b>{MEMBER_URL}</b> - URL to the Staff Member's single page<br> <b>{MEMBER_IMAGE}</b> - URL to the Staff Member's featured image<br> <b>{MEMBER_PHONE}</b> - The Staff Member's phone number (if you enabled it on the Social tab)
hu_hu: Sablonszerkesztő a csapattagok dobozaihoz. A következő változókat használhatod a sabloban:<br> <b>{MEMBER_NAME}</b> - A tag neve (a szerkesztőben a cikk címe)<br> <b>{MEMBER_EXCERPT}</b> - Rövid leírás a tagról (a cikk kivonata)<br> <b>{MEMBER_TITLE}</b> - A tag munkaköre (Munkakör taxonómia), vesszőkkel elválasztva ha több is van<br> <b>{MEMBER_SOCICONS}</b> - A tag közösségi linkjei<br> <b>{MEMBER_URL}</b> - A tag egyedi oldalára mutató URL<br> <b>{MEMBER_IMAGE}</b> - A tag fényképére mutató URL <b>{MEMBER_PHONE}</b> - A tag telefonszáma (ha engedélyezve van a Közösségi fülön)

source: Load basic front end CSS?
hu_hu: Alap stílusok beolvasása?

source: If Yes is selected, a small CSS file will be loaded in the front end in order to give some shape for the Staff Member boxes.<br> Select No if you have your own style rules for a-staff boxes in your theme's stylesheets (recommended only for experts).
hu_hu: Ha Igen, akkor egy kis CSS fájl fog betöltődni a weboldalon annak érdekében, hogy némi formát adjon a csapattag-dobozoknak.<br> A Nem-et akkor válaszd, ha a weboldal-sablonod rendelkezik a megfelelő stíluslapokkal az a-staff dobozok megjelenítéséhez (csak szakértőknek ajánlott).

source: Responsive behavior
hu_hu: Reszponzivitás

source: Should the built-in styles support responsive behavior? "No" is only recommended for non-responsive themes.
hu_hu: A beépített stíluslapok legyenek reszponzívek? A "Nem" csak nem-reszponzív weboldalak esetén ajánlott.

source: Responsive breakpoints
hu_hu: Reszponzív ütközőpontok

source: You can fine-tune here the behavior of the team member columns for smaller screens.
hu_hu: Itt finomhangolhatod a csapattag-dobozokat tartalmazó oszlopok viselkedését kisebb képernyőkön.

source: Breakpoint #1 (5-6 → 3)
hu_hu: Ütközőpont #1 (5-6 → 3)

source: Under this window width the 5 and 6 column layouts change to 3-column layout
hu_hu: Ezen képernyő-szélesség alatt az 5 és 6 oszlopos kinézet 3 oszloposra vált

source: Breakpoint #2 (3-6 → 2)
hu_hu: Ütközőpont #2 (3-6 → 2)

source: Under this window width the 3, 4, 5 and 6 column layouts change to 2-column layout
hu_hu: Ezen képernyő-szélesség alatt a 3, 4, 5 és 6 oszlopos kinézet 2 oszloposra vált

source: Breakpoint #3 (2-6 → 1)
hu_hu: Ütközőpont #3 (2-6 → 1)

source: Under this window width all the multi-column layouts change to 1-column layout
hu_hu: Ezen képernyő-szélesség alatt minden többoszlopos kinézet 1 oszloposra vált

source: Staff Member's social profiles
hu_hu: A csapattag közösségi profiljai

source: Enter the URLs for the social links here. If left empty, it won't appear in the front end.
hu_hu: Írd be az URL-eket a közösségi linkekhez itt. Az üresen hagyott URL-ek nem fognak megjelenni.

source: URL starting with http://, https://, mailto:, etc.
hu_hu: URL http://, https://, mailto:, stb. kezdettel.

source: Member's phone number
hu_hu: A tag telefonszáma

source: Delete data on plugin uninstall?
hu_hu: Adatok törlése a bővítmény eltávolításakor?

source: If yes, all data will be removed when you delete the a-staff plugin. Otherwise the data added by the plugin will be kept in the database.
hu_hu: Ha Igen, akkor minden adat törlődni fog amikor az a-staff bővítményt eltávolítjuk. Egyébként az adatok benne maradnak az adatbázisban.
